using System.Reflection;
using System.Runtime.InteropServices;

// Управление общими сведениями о сборке осуществляется с помощью
// набора атрибутов. Измените значения этих атрибутов, чтобы изменить сведения,
// связанные со сборкой.
[assembly: AssemblyTitle("Загрузка файлов на Яндекс Народ.Диск")]
[assembly: AssemblyDescription("Данная программа предназначена для загрузки файлов на интернет-ресурс Народ.Диск компании Яндекс.\r\nНикакого непосрественного отношения к ООО \"Яндекс\" не имеет, и является сторонней разработкой.\r\n\r\nПоскольку ресурс Народ.Диск может меняться, то своевременная поддержка не гарантируется.\r\n\r\nАвтор программа не несёт ответственности за потерю файлов в следствии использования данного ПО.")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("")]
[assembly: AssemblyProduct("Менеджер файлов на Яндекс Народ.Диск")]
[assembly: AssemblyCopyright("Loveworthy © 2011")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]

// Параметр ComVisible со значением FALSE делает типы в сборке невидимыми
// для COM-компонентов.  Если требуется обратиться к типу в этой сборке через
// COM, задайте атрибуту ComVisible значение TRUE для этого типа.
[assembly: ComVisible(false)]

// Следующий GUID служит для идентификации библиотеки типов, если этот проект будет видимым для COM
[assembly: Guid("3292269a-0544-41d5-b52c-b98b5f27de1d")]

// Сведения о версии сборки состоят из следующих четырех значений:
//
//      Основной номер версии
//      Дополнительный номер версии
//      Номер построения
//      Редакция
//
// Можно задать все значения или принять номер построения и номер редакции по умолчанию,
// используя "*", как показано ниже:
// [assembly: AssemblyVersion("1.0.*")]
[assembly: AssemblyVersion("1.0.1.1")]
[assembly: AssemblyFileVersion("1.0.0.1")]